## Working on Series and Dataframe

In [2]:
import numpy as np
import pandas as pd

In [3]:
ser = pd.Series(np.random.rand(34))
# This will create a series with 34 random numbers.

In [4]:
ser

0     0.997584
1     0.125086
2     0.695239
3     0.885982
4     0.748286
5     0.807153
6     0.943517
7     0.006658
8     0.316486
9     0.214490
10    0.404614
11    0.430616
12    0.100761
13    0.264854
14    0.529485
15    0.007271
16    0.110574
17    0.932573
18    0.991201
19    0.371221
20    0.060696
21    0.256331
22    0.911484
23    0.303961
24    0.969867
25    0.317964
26    0.862300
27    0.395320
28    0.159504
29    0.612493
30    0.993916
31    0.500314
32    0.933863
33    0.970759
dtype: float64

In [5]:
type(ser)

pandas.core.series.Series

In [6]:
newdf = pd.DataFrame(np.random.rand(334,5), index = np.arange(334))
# This will create a dataframe with 334 rows and 5 columns and index will be from 0 to 333.

In [7]:
newdf.head() # This will print the first 5 rows of the dataframe.

          0         1         2         3         4
0  0.893927  0.160707  0.920912  0.746738  0.565368
1  0.163393  0.278670  0.567496  0.775282  0.706926
2  0.052016  0.368827  0.283096  0.715614  0.587618
3  0.761822  0.541695  0.814828  0.379714  0.292251
4  0.342498  0.943094  0.660463  0.097091  0.513363

In [8]:
type(newdf)

pandas.core.frame.DataFrame

In [9]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [10]:
newdf2 = pd.DataFrame(np.random.rand(334, 5), index=np.arange(1, 335))
# This will create a dataframe with 334 rows and 5 columns and index will be from 1 to 334.

In [11]:
newdf2

            0         1         2         3         4
1    0.689427  0.645372  0.184795  0.730113  0.043283
2    0.655907  0.497548  0.584523  0.059352  0.784675
3    0.846908  0.051571  0.973098  0.161522  0.663275
4    0.136499  0.551596  0.835631  0.663100  0.850525
5    0.239381  0.061242  0.654752  0.892411  0.053491
..        ...       ...       ...       ...       ...
330  0.812606  0.737963  0.436768  0.524298  0.025553
331  0.858142  0.998267  0.840326  0.757878  0.907571
332  0.867163  0.646606  0.174553  0.650819  0.043373
333  0.565575  0.311466  0.070358  0.916548  0.766639
334  0.576536  0.265213  0.142215  0.748227  0.638986

[334 rows x 5 columns]

In [12]:
newdf2.to_csv('newdf2.csv', index=False)
# This will save the dataframe to a csv file.

In [13]:
newdf.describe() # This will give the statistical data of the dataframe.

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.486967    0.503142    0.520699    0.509325    0.514465
std      0.290457    0.299879    0.284447    0.306741    0.282496
min      0.002901    0.003031    0.000096    0.000626    0.000272
25%      0.244317    0.233169    0.283464    0.209875    0.277788
50%      0.481902    0.483170    0.524491    0.548264    0.522239
75%      0.719032    0.758199    0.775509    0.793341    0.755666
max      0.999280    0.996735    0.998095    0.995181    0.998793

In [14]:
newdf.dtypes # This will give the data types of the columns of the dataframe.

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [15]:
newdf2[0][0] = "Gaurav"
# This will change the value of the first row and first column to "Gaurav".

In [16]:
newdf

            0         1         2         3         4
0    0.893927  0.160707  0.920912  0.746738  0.565368
1    0.163393  0.278670  0.567496  0.775282  0.706926
2    0.052016  0.368827  0.283096  0.715614  0.587618
3    0.761822  0.541695  0.814828  0.379714  0.292251
4    0.342498  0.943094  0.660463  0.097091  0.513363
..        ...       ...       ...       ...       ...
329  0.009264  0.082817  0.318184  0.887579  0.577168
330  0.303053  0.506708  0.871810  0.843298  0.186945
331  0.988841  0.705021  0.297276  0.062716  0.802622
332  0.419171  0.808183  0.121492  0.943192  0.945246
333  0.437928  0.987388  0.214884  0.397667  0.082383

[334 rows x 5 columns]

In [17]:
newdf2.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

### Printing the index of data frame

In [18]:
newdf2.index

Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
       ...
       325, 326, 327, 328, 329, 330, 331, 332, 333, 334],
      dtype='int64', length=334)

In [19]:
newdf2.columns

RangeIndex(start=0, stop=5, step=1)

### To convert Pandas Series or Dataframe into numpy array

In [20]:
newdf2.to_numpy()
# This will convert the dataframe to a numpy array.

array([[0.68942731, 0.64537222, 0.18479457, 0.73011267, 0.04328282],
       [0.65590701, 0.49754763, 0.58452341, 0.05935237, 0.78467477],
       [0.84690833, 0.05157135, 0.97309778, 0.16152225, 0.66327471],
       ...,
       [0.8671627 , 0.6466062 , 0.17455314, 0.65081883, 0.0433731 ],
       [0.56557464, 0.31146613, 0.07035768, 0.91654803, 0.76663933],
       [0.57653588, 0.26521318, 0.1422149 , 0.74822748, 0.63898581]])

### To sort (in descending order)

In [21]:
newdf2.sort_index(axis=0, ascending=False)
# This will sort the dataframe in descending order.

            0         1         2         3         4
334  0.576536  0.265213  0.142215  0.748227  0.638986
333  0.565575  0.311466  0.070358  0.916548  0.766639
332  0.867163  0.646606  0.174553  0.650819  0.043373
331  0.858142  0.998267  0.840326  0.757878  0.907571
330  0.812606  0.737963  0.436768  0.524298  0.025553
..        ...       ...       ...       ...       ...
5    0.239381  0.061242  0.654752  0.892411  0.053491
4    0.136499  0.551596  0.835631  0.663100  0.850525
3    0.846908  0.051571  0.973098  0.161522  0.663275
2    0.655907  0.497548  0.584523  0.059352  0.784675
1    0.689427  0.645372  0.184795  0.730113  0.043283

[334 rows x 5 columns]

In [ ]:
newdf2[0] # Prints the first column of the dataframe.

1      0.689427
2      0.655907
3      0.846908
4      0.136499
5      0.239381
         ...
330    0.812606
331    0.858142
332    0.867163
333    0.565575
334    0.576536
Name: 0, Length: 334, dtype: float64

In [23]:
newdf2.head()

          0         1         2         3         4
1  0.689427  0.645372  0.184795  0.730113  0.043283
2  0.655907  0.497548  0.584523  0.059352  0.784675
3  0.846908  0.051571  0.973098  0.161522  0.663275
4  0.136499  0.551596  0.835631  0.663100  0.850525
5  0.239381  0.061242  0.654752  0.892411  0.053491

In [24]:
newdf3 = newdf2

In [25]:
newdf3

            0         1         2         3         4
1    0.689427  0.645372  0.184795  0.730113  0.043283
2    0.655907  0.497548  0.584523  0.059352  0.784675
3    0.846908  0.051571  0.973098  0.161522  0.663275
4    0.136499  0.551596  0.835631  0.663100  0.850525
5    0.239381  0.061242  0.654752  0.892411  0.053491
..        ...       ...       ...       ...       ...
330  0.812606  0.737963  0.436768  0.524298  0.025553
331  0.858142  0.998267  0.840326  0.757878  0.907571
332  0.867163  0.646606  0.174553  0.650819  0.043373
333  0.565575  0.311466  0.070358  0.916548  0.766639
334  0.576536  0.265213  0.142215  0.748227  0.638986

[334 rows x 5 columns]

In [26]:
newdf2

            0         1         2         3         4
1    0.689427  0.645372  0.184795  0.730113  0.043283
2    0.655907  0.497548  0.584523  0.059352  0.784675
3    0.846908  0.051571  0.973098  0.161522  0.663275
4    0.136499  0.551596  0.835631  0.663100  0.850525
5    0.239381  0.061242  0.654752  0.892411  0.053491
..        ...       ...       ...       ...       ...
330  0.812606  0.737963  0.436768  0.524298  0.025553
331  0.858142  0.998267  0.840326  0.757878  0.907571
332  0.867163  0.646606  0.174553  0.650819  0.043373
333  0.565575  0.311466  0.070358  0.916548  0.766639
334  0.576536  0.265213  0.142215  0.748227  0.638986

[334 rows x 5 columns]

In [27]:
# The above newdf3 is just a view of newdf2 and not a copy of it.
# To make a copy of the dataframe, we can use the following command.
newdf3 = newdf2.copy()

In [28]:
newdf2

            0         1         2         3         4
1    0.689427  0.645372  0.184795  0.730113  0.043283
2    0.655907  0.497548  0.584523  0.059352  0.784675
3    0.846908  0.051571  0.973098  0.161522  0.663275
4    0.136499  0.551596  0.835631  0.663100  0.850525
5    0.239381  0.061242  0.654752  0.892411  0.053491
..        ...       ...       ...       ...       ...
330  0.812606  0.737963  0.436768  0.524298  0.025553
331  0.858142  0.998267  0.840326  0.757878  0.907571
332  0.867163  0.646606  0.174553  0.650819  0.043373
333  0.565575  0.311466  0.070358  0.916548  0.766639
334  0.576536  0.265213  0.142215  0.748227  0.638986

[334 rows x 5 columns]

In [29]:
newdf2.drop(0, axis=1)
# This will drop the first column of the dataframe.

            1         2         3         4
1    0.645372  0.184795  0.730113  0.043283
2    0.497548  0.584523  0.059352  0.784675
3    0.051571  0.973098  0.161522  0.663275
4    0.551596  0.835631  0.663100  0.850525
5    0.061242  0.654752  0.892411  0.053491
..        ...       ...       ...       ...
330  0.737963  0.436768  0.524298  0.025553
331  0.998267  0.840326  0.757878  0.907571
332  0.646606  0.174553  0.650819  0.043373
333  0.311466  0.070358  0.916548  0.766639
334  0.265213  0.142215  0.748227  0.638986

[334 rows x 4 columns]

In [30]:
newdf2.columns = list("ABCDE")

In [31]:
newdf2.head()

          A         B         C         D         E
1  0.689427  0.645372  0.184795  0.730113  0.043283
2  0.655907  0.497548  0.584523  0.059352  0.784675
3  0.846908  0.051571  0.973098  0.161522  0.663275
4  0.136499  0.551596  0.835631  0.663100  0.850525
5  0.239381  0.061242  0.654752  0.892411  0.053491

In [32]:
newdf2.rows = list("PQRST")

/var/folders/cl/x9wrct2x4gbdwtlryyq4tlnw0000gn/T/ipykernel_23113/2100845196.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  newdf2.rows = list("PQRST")

In [33]:
newdf2.head()

          A         B         C         D         E
1  0.689427  0.645372  0.184795  0.730113  0.043283
2  0.655907  0.497548  0.584523  0.059352  0.784675
3  0.846908  0.051571  0.973098  0.161522  0.663275
4  0.136499  0.551596  0.835631  0.663100  0.850525
5  0.239381  0.061242  0.654752  0.892411  0.053491

In [35]:
newdf.loc[[0, 1], [0, 1]] # This will give the values of the rows 0 and 1 and columns 0 and 1.

          0         1
0  0.893927  0.160707
1  0.163393  0.278670

# Working with loc and iloc

In [36]:
df = pd.DataFrame(np.random.rand(5,5), index=[1, 2, 3, 4, 5], columns=["A", "B", "C", "D", "E"])

In [37]:
df

          A         B         C         D         E
1  0.793202  0.671507  0.725456  0.047466  0.252222
2  0.185398  0.417769  0.561684  0.395153  0.924662
3  0.791201  0.619030  0.249213  0.995319  0.392760
4  0.753669  0.848532  0.261386  0.449641  0.735565
5  0.902310  0.346883  0.298554  0.099407  0.938917

In [47]:
# Accessing the elements of the dataframe.
df.loc[1, "A"]

0.7932023603190848

In [48]:
# Doing same thing using iloc.
df.iloc[0,0]

0.7932023603190848

In [49]:
# Slicing the dataframe.
df.loc[1:3, "A":"C"] # This will give the values of rows 1 to 3 and columns A to C.

          A         B         C
1  0.793202  0.671507  0.725456
2  0.185398  0.417769  0.561684
3  0.791201  0.619030  0.249213

In [51]:
# Assigning values to the dataframe.
df.loc[1,"B"] = 10

df

          A          B         C         D         E
1  0.793202  10.000000  0.725456  0.047466  0.252222
2  0.185398   0.417769  0.561684  0.395153  0.924662
3  0.791201   0.619030  0.249213  0.995319  0.392760
4  0.753669   0.848532  0.261386  0.449641  0.735565
5  0.902310   0.346883  0.298554  0.099407  0.938917

### Running Complex queries

In [39]:
# To select those rows which have values greater than 0.5 in column A.
df.loc[df["A"] > 0.5]

          A         B         C         D         E
1  0.793202  0.671507  0.725456  0.047466  0.252222
3  0.791201  0.619030  0.249213  0.995319  0.392760
4  0.753669  0.848532  0.261386  0.449641  0.735565
5  0.902310  0.346883  0.298554  0.099407  0.938917

In [ ]:
# To select those rows which have values greaten than 0.5 in column A and less than 0.8 in column B.
df.loc[(df["A"] > 0.5) & (df["B"] < 0.8)]

          A         B         C         D         E
1  0.793202  0.671507  0.725456  0.047466  0.252222
3  0.791201  0.619030  0.249213  0.995319  0.392760
5  0.902310  0.346883  0.298554  0.099407  0.938917